//Result json file
{
  "date": "2023-06-18T17:18:10.070Z",
  "output": [
    {
      "number": 1,
      "recipe": "Preheat oven to 375 F..Place mushroom caps hollow side up on baking sheet. Fill each cap with 1 tsp. Alouette Garlic & Herbs.Spreadable Cheese and sprinkle with seasoned bread crumbs..Bake 12-15 minutes..Garnish and serve."
    },
    {
      "number": 2,
      "recipe": "Slice the tomato into thin round discs..Roll the mint and sage leaves into a tight ball and then chop it up finely..Add to the olive oil and sumac to make a dressing..Drizzle over the tomato slices"
    },
    {
      "number": 3,
      "recipe": "Fill sauteed caps with mixture of rest of ingredients and sprinkle generously with Parmesan cheese..Bake at 350 degrees for 10 minutes."
    },
    {
      "number": 4,
      "recipe": "Recipe does not exist"
    },
    {
      "number": 5,
      "recipe": "In a medium pot, melt butter over medium heat..Cut onion into 4 wedges and add to the pot along with the canned tomatoes and vegetable broth. Bring to a simmer. Simmer, uncovered, for about 40 minutes. Stir occasionally.Blend the soup with an immersion blender and season to taste.If you happen to have fresh basil on hand, throw in a handful before blending."
    }
  ]
}{
  "date": "2023-06-18T17:33:58.200Z",
  "output": [
    {
      "number": 1,
      "recipe": "Combine the diced rhubarb,sugar, the cornstarch and salt in a medium saucepan and place over medium-low heat..Cook, stirring occasionally, until the rhubarb releases its liquid and begins to breakdown, creating a thick, chunky sauce, about 10 minutes..Remove the pan from the heat and stir in the vanilla extract..Set aside to cool to room temperature..Layer 4 phyllo sheets, brushing each with melted butter..Meanwhile, preheat the oven to 350 degrees F..Now let us cut four 4-inch squares from phyllo stack..Place 2 teaspoons of filling in center of square..Brush phyllo from edge of filling to each point of square lightly with water..Gather points of square and pinch together just above filling..Brush pouch with butter. Repeat process for all 4 pouches..Place filled pouches at least 1\" apart on ungreased cookie sheet or baking pan..Bake in preheated 350F oven for 12 to 15 minutes or until golden brown..Take the pouches out and let them cool on wire rack for ~5 minutes..Serve warm or at room temperature."
    },
    {
      "number": 2,
      "recipe": "Place all ingredients in a bowl..Whisk until a layer of bubbles forms on the surface and the sugar is dissolved..Pour the mixture into the canister of the ice cream maker and churn according to manufacturer's directions."
    },
    {
      "number": 3,
      "recipe": "Combine 2  cups of sugar, water, vanilla, and orange extract in a sauce pan..Heat over medium until the sugar has completely dissolvedbut not boiling..Pour in the cranberries and stir. The hot syrup will loosen the skin, saturate the berries and adhere to the berries over time..Cover the cranberries with a small plate to keep them mostly submerged. Then cover the pan and place it in the refrigerator over night..Place the remaining 1  cup of sugar in a rimmed dish. Strain the cranberries and place them in the sugar. Shake until they are completely coated..Carefully transfer them to a baking sheet to dryabout an hour..Once the sugar coating is hard, place them in an air-tight container and keep in a cool spot for up to a week!.Dont forget to refrigerate your Cranberry Infused Vanilla-Orange Syrup for cocktail time!"
    },
    {
      "number": 4,
      "recipe": "Brush 4 individual ovenproof cups with melted butter..Whisk eggs,sugar,milk,cream and vanilla in a medium bowl for a minute..Pour into prepared dish..Place the filled dish into a shallow baking dish..Pour enough hot water into baking dish to cover halfway up the sides.Dust the nutmeg on top of the custard..Place the dish on a preheated oven and bake it for about 30 minutes or until the custard is set.A sharp knife comes out clean when inserted..Remove the dish from water immediately..Serve cold.COOK'S FILESTORAGE TIME:Its best served cold.Cook the custard a day in advance and store,covered in refrigerator.HINT:I went all out and sprinkled a little nesquik on top just before serving it cold."
    },
    {
      "number": 5,
      "recipe": "Cool Whip whipped dessert topping.Mix cake as directed..Add 6 ounces coconut and coconut flavoring..Bake as directed on box."
    }
  ]
}
